Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase Methods
The ApplicationWindowBase type exposes the following members.
Methods
Name | Description
ApplyValues
 Loads the dialog values from a file and performs Apply() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from WindowBase.)
GetConnectionStatus
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
 (Inherited from WindowBase.)
InitializeDataStorage
 Initializes the datastorage and registers property bindings for defined viewmodel.
InitializeWindow
 Prepares the data storage for the dialog and scans through the fields.
 (Inherited from WindowBase.)
LoadValues
 Loads the dialog values from a file. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from WindowBase.)
ModifyValues
 Loads the dialog values from a file and performs Modify() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 (Inherited from WindowBase.)
SaveValues
 Serializes the dialog values to an xml file.
 (Inherited from WindowBase.)
ShowWindow
 Displays the window.
 (Inherited from WindowBase.)
UpdateDataStorageFromViewModel
 DO NOT USE! For internal usage only!
 (Inherited from WindowBase.)
Top
See Also
Reference
ApplicationWindowBase Class
Tekla.Structures.Dialog Namespace